In [1]:
import sqlite3
import pandas as pd

In [2]:
import sqlite3
conn = sqlite3.connect('my_database.db')
c = conn.cursor()

In [67]:
#   c.execute('''DROP TABLE merged_table''')

In [5]:
# c.execute('''CREATE TABLE merged_table (FullPhoneNumber text PRIMARY KEY,state text,cityname text,persongender  text,personexactage text,personmaritalstatus text,traveler text,ZipCode text,investment text,estimatedincomecode text,timezone text,DONOTCALL text,"PresenceOfCreditCard" text,CreditRating  text )''')

In [ ]:
# c.execute('''INSERT INTO merged_table SELECT * FROM table_2018''')

In [32]:
# c.execute('''INSERT INTO merged_table SELECT * FROM table_2018 
#                                     UNION
#                                     SELECT * FROM table_2021''')

In [34]:
# pd.read_sql('''SELECT * FROM merged_table
#              LIMIT 10''',conn)

In [35]:
# ATTACH DATABASE file_name AS new_db;
# c.execute('''USE my_database''')

In [4]:
# c.execute('''ATTACH DATABASE cdr_database AS cdr_db''')

In [3]:
c.execute('''ATTACH DATABASE my_database1 AS merge_db''')

In [68]:
# c.execute('''Drop Table merge_db.Cdr''')

In [30]:
c.execute('''CREATE TABLE merge_db.Cdr(FullPhoneNumber text NOT NULL Primary Key , Date text, Duration int)''')

In [31]:
data = pd.read_csv('Cdr_merged_data.csv')

In [32]:
data

         Unnamed: 0  FullPhoneNumber                 Date  Duration
0                 0     9.788367e+09  2021-01-02 15:04:58      0.00
1                 1     6.316652e+09  2021-01-02 15:04:59     29.00
2                 2     9.736973e+09  2021-01-02 15:04:59     33.00
3                 3     5.167999e+09  2021-01-02 15:04:59     34.00
4                 4     8.503003e+09  2021-01-02 15:04:59      0.00
...             ...              ...                  ...       ...
3970537     3970537     1.615715e+10      1/20/2021 15:50      7.69
3970538     3970538     1.519728e+10      1/20/2021 15:50      2.21
3970539     3970539     1.412836e+10      1/20/2021 15:50      2.58
3970540     3970540     1.615500e+10      1/20/2021 15:50      2.15
3970541     3970541     1.609307e+10      1/20/2021 15:50      0.04

[3970542 rows x 4 columns]

In [33]:
data = data.drop("Unnamed: 0",axis=1)

In [34]:
data

         FullPhoneNumber                 Date  Duration
0           9.788367e+09  2021-01-02 15:04:58      0.00
1           6.316652e+09  2021-01-02 15:04:59     29.00
2           9.736973e+09  2021-01-02 15:04:59     33.00
3           5.167999e+09  2021-01-02 15:04:59     34.00
4           8.503003e+09  2021-01-02 15:04:59      0.00
...                  ...                  ...       ...
3970537     1.615715e+10      1/20/2021 15:50      7.69
3970538     1.519728e+10      1/20/2021 15:50      2.21
3970539     1.412836e+10      1/20/2021 15:50      2.58
3970540     1.615500e+10      1/20/2021 15:50      2.15
3970541     1.609307e+10      1/20/2021 15:50      0.04

[3970542 rows x 3 columns]

In [35]:
data['FullPhoneNumber'] = data['FullPhoneNumber'].astype(str)

In [36]:
data['Date'] = data['Date'].astype(str)

In [37]:
data['Duration'] = data['Duration'].astype(int)

In [38]:
data

        FullPhoneNumber                 Date  Duration
0          9788367424.0  2021-01-02 15:04:58         0
1          6316652128.0  2021-01-02 15:04:59        29
2          9736973406.0  2021-01-02 15:04:59        33
3          5167998519.0  2021-01-02 15:04:59        34
4          8503002557.0  2021-01-02 15:04:59         0
...                 ...                  ...       ...
3970537   16157147558.0      1/20/2021 15:50         7
3970538   15197283494.0      1/20/2021 15:50         2
3970539   14128358218.0      1/20/2021 15:50         2
3970540   16155000761.0      1/20/2021 15:50         2
3970541   16093065506.0      1/20/2021 15:50         0

[3970542 rows x 3 columns]

In [41]:
data.to_sql('Cdr',conn, if_exists='append',index=False)

In [80]:
sql_merge_Cdr = pd.read_sql('''SELECT * FROM Cdr
                            LIMIT 100''',conn)
sql_merge_Cdr

   FullPhoneNumber                 Date  Duration
0     9788367424.0  2021-01-02 15:04:58         0
1     6316652128.0  2021-01-02 15:04:59        29
2     9736973406.0  2021-01-02 15:04:59        33
3     5167998519.0  2021-01-02 15:04:59        34
4     8503002557.0  2021-01-02 15:04:59         0
..             ...                  ...       ...
95    6143544874.0  2021-01-02 15:05:34         0
96    9038063719.0  2021-01-02 15:05:35         0
97    7575152291.0  2021-01-02 15:05:36         0
98    4103675357.0  2021-01-02 15:05:39         5
99    8644266171.0  2021-01-02 15:05:39         0

[100 rows x 3 columns]

In [92]:
c.execute('''Drop TABLE merge_db.merged_table''')

In [93]:
c.execute('''CREATE TABLE merge_db.merged_table(FullPhoneNumber text , state text,cityname text,persongender  text,personexactage text,personmaritalstatus text,traveler text,ZipCode text,investment text,estimatedincomecode text,timezone text,DONOTCALL text,"PresenceOfCreditCard" text,CreditRating  text, Foreign key (FullPhoneNumber) References Cdr(FullPhoneNumber) )''')

In [94]:
c.execute('''INSERT INTO merge_db.merged_table SELECT * FROM table_2018''')

In [95]:
c.execute('''INSERT INTO merge_db.merged_table SELECT * FROM table_2021''')

In [3]:
sql_File=pd.read_sql('''SELECT * FROM merge_db.merged_table
                        LIMIT 200''',conn)
sql_File

DatabaseError: Execution failed on sql 'SELECT * FROM merge_dbmerged_table
                        LIMIT 200': no such table: merge_dbmerged_table

In [4]:
sql = pd.read_sql('''SELECT * FROM  merged_table
                    LIMIT 150''',conn)
sql

DatabaseError: Execution failed on sql 'SELECT * FROM  merged_table
                    LIMIT 150': no such table: merged_table

# Creating Final Table By joining Cdr and merge data of 2018 and 2021

In [ ]:
pd.read_sql('''SELECT *  FROM Cdr as c
                        INNER JOIN  merged_table as merge
                        On c.FullPhoneNumber=merge.FullPhoneNumber
                        LIMIT 200''',conn).to_csv('Final_data.csv')

In [82]:
c.execute('''ATTACH DATABASE Final_db as Final_database''')

OperationalError: database Final_database is already in use

In [83]:
c.execute('''CREATE TABLE Final_db(FullPhoneNumber text , state text,cityname text,persongender  text,personexactage text,personmaritalstatus text,traveler text,ZipCode text,investment text,estimatedincomecode text,timezone text,DONOTCALL text,"PresenceOfCreditCard" text,CreditRating  text,Date text, Duration int )''')

OperationalError: table Final_db already exists

In [85]:
c.execute('''INSERT INTO Final_db SELECT merge.FullPhoneNumber, state,cityname,
    persongender,personexactage,personmaritalstatus,traveler ,ZipCode ,
    investment, merge.estimatedincomecode,merge.timezone,DONOTCALL,PresenceOfCreditCard,
    CreditRating,Date,Duration  FROM merged_table as merge
                        INNER JOIN  Cdr as c
                        On c.FullPhoneNumber=merge.FullPhoneNumber''')

In [86]:
sql = pd.read_sql('''SELECT * FROM Final_db
                    LIMIT 10''',conn)
sql

Empty DataFrame
Columns: [FullPhoneNumber, state, cityname, persongender, personexactage, personmaritalstatus, traveler, ZipCode, investment, estimatedincomecode, timezone, DONOTCALL, PresenceOfCreditCard, CreditRating, Date, Duration]
Index: []